app/controllers/events_controller.rb

INSERT INTO `events` (`event_dt`, `title`, `description`) VALUES('2011-01-06 07:25:00', 'title', 'desc')
---
  def create
    @event = Event.new params[:event]
    @event.users << current_user

UPDATE `events` SET `event_dt` = '2011-01-12 10:26:00' WHERE `id` = 2
---
  def update
    @prev_date = @event.event_dt
    respond_to do |format|
      if @event.update_attributes params[:event]

DELETE FROM `events` WHERE `id` = 4
---
  def destroy
    @event.destroy

SELECT * FROM `events` WHERE (`events`.`id` = '4') LIMIT 1
SELECT * FROM `events` LIMIT 1
---
  def find_event
    @event = Event.find_by_id params[:id]
    redirect_to root_path if @event.blank?