app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `crypted_password`, `perishable_token`, `password_salt`, `birthday`, `persistence_token`, `email`) VALUES('name', 'bbebfbdc9d3eb97a00787070a4a9792b8412022b4a33179a06c50ebca5f3e98fa3549d79dfb27dc7061af44619231c6daf55fd84cee35fe98aae1d51a6bb405a', 'xm0FSlcig7xq2LYMrFQP', 'Mm4P4666D0mEsmsaWDGU', '2011-01-05', '715259ecdeabbb07bf25d8ae5335aadc86f5ffa19109d1c1a7209a42100ed69d6f7b5ec33798a22f4e925f8a62b6db19c9b808d83b838129fd6af9bb5b88d3bb', 'atar@at.ar')
---
  def create
    @user = User.new params[:user]
    if @user.save

UPDATE `users` SET `perishable_token` = 'xCrfWblvTjgv80ACgViX' WHERE `id` = 1
---
  def update
    if @user.update_attributes params[:user]

DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user.destroy

SELECT * FROM `users` WHERE (`users`.`id` = '#<UserSession:0x4903ae0>') LIMIT 1
---
  def find_user
    @user = User.find_by_id params[:id]